[{"created":"2024-12-09T09:46:44Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/960","status":"open","title":"Brugerudtræk af oprettede aktører i DataHub 3.0"},{"created":"2024-12-09T09:46:17Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/959","status":"open","title":"Brugerudtræk for alle DataHub-selskabets brugere i DataHub 3.0"},{"created":"2024-12-09T09:45:45Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/958","status":"open","title":"Dokumentation for Enkel Energis aktøroprettelse"},{"created":"2024-12-09T09:40:06Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/957","status":"open","title":"Rettighedsstyrring"},{"created":"2024-12-09T09:39:45Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/956","status":"open","title":"UI til upload"},{"created":"2024-12-09T09:38:02Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/955","status":"open","title":"Afsend ny RSM-012 fil til DH2"},{"created":"2024-12-09T09:36:31Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/954","status":"open","title":"Konverter json til RSM-012 fil"},{"created":"2024-12-09T09:35:51Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/953","status":"open","title":"Endpoint til upload oprettes"},{"created":"2024-12-05T13:54:48Z","description":"**Beskrivelse af format ifbm. import**\nhttps://learn.microsoft.com/en-us/azure/devops/boards/queries/import-work-items-from-csv?view=azure-devops\n\n**Valg af template (Agile eller Scrum)**\nhttps://learn.microsoft.com/en-us/azure/devops/boards/work-items/guidance/work-item-field?view=azure-devops\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/952","status":"open","title":"POC Azure Devops"},{"created":"2024-12-04T12:48:11Z","description":"Revisioren har efterspurgt følgende data\n\n- Jeg anmoder om dokumentation for Enkel Energis aktøroprettelse, hvor jeg kan se, hvilken markedsrolle og brugerrolle er tildelt den første bruger for aktøren. Det skal desuden fremgå hvornår dette er sket. Jeg synes ikke at kunne se dette ud af ServiceNow-sagen.\n- Jeg anmoder, så vidt det er muligt, om et brugerudtræk for alle DataHub-selskabets brugere i DataHub 3.0, hvor oplysninger om bruger, person, oprettelsesdato og aktiv-status medgår.\n- Jeg anmoder, så vidt det er muligt, om et brugerudtræk af oprettede aktører i DataHub 3.0, hvor oplysninger om bruger, selskab, aktørtype, person, oprettelsesdato og aktiv-status medgår.\n\nAfhængig af kompleksitet skal vi enten udstille dataene i UI eller også laver vi ovenstående som specifikke SQL udtræk. Vi diskuterer på planning.\n\nSvaret skal ind i denne skabelon: [Revisionsskabelon _DataHub_2024.docx](https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBK3dEQ0E9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--b0eb4e5f362ccd1e7613ad9c2dff12e1fb976a82/Revisionsskabelon%20_DataHub_2024.docx)\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/950","status":"open","title":"Revisionsudtræk"},{"created":"2024-12-04T12:33:03Z","description":"Inden opgave laves: Afklar om whitelisting er stadig en ting.\n\nVi har i dag en whitelisting model for tilknytning af netområder til aktører, som blev udarbejdet for 3 år siden, og ikke er blevet brugt. Denne model er  muligvis ikke retvisende mere og kan skrives om for at gøre koden mere simpel.\n\nAC:\n- [ ] Netvirksomhed for et netområde bliver flyttet til GridArea tabellen.\n- [ ] EicFunction/Market Role bliver lagt på aktør direkte.\n- [ ] ActorMarketRole og co. bliver slettet.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/949","status":"open","title":"Refac: Nedlæg whitelisting model for aktør/refaktorér netområder og ejer"},{"created":"2024-12-04T08:02:23Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/948","status":"open","title":"Research - Målepunktsstamdata - Aktør"},{"created":"2024-11-29T16:12:06Z","description":"Som udvikler i Volt vil jeg gerne kunne se de stamdata, der er læst ind i SQL baseret på data fra migreringsdomænet, så jeg kan validere at data er korrekte.\n\n**AC**\n\n- [ ] Via søgning på målepunktsnummer ønsker jeg at se alle de data, der er registreret på målepunktet uden yderligere formattering, blot visning af feltnavn og -indhold\n- [ ] Det skal være muligt at tilgå via Datahub UI\n- [ ] Funktionen må ikke være tilgængelig for aktører uden for Energinet i produktion\n- [ ] Funktionen skal være tilgængelig for FAS brugere\n- [ ] Søgning skal logges i Auditlog","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/946","status":"open","title":"Simpel stamdataside til datavalidering"},{"created":"2024-11-29T12:58:13Z","description":"\n### Liste over aktiviteter\n- [ ] Fjerne durable functions\n- [ ] Fjerne Terraform\n- [ ] Frontend\n- [ ] Gøre feltet \"JobID\" ikke-nullable\n\n\n_Hvilke afhængigheder har vi til Mandalorian (de skal også fjerne noget)_","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/945","status":"open","title":"Fjern Option 1 fra settlement reports."},{"created":"2024-11-26T14:07:44Z","description":"Det giver lidt udfordringer i afregningsrapporter, at brugeren kan vælge en periode i datepicker, som der ikke er kørt en specifik type beregning for. Så de kan i UI vælge beregningstyper og en periode, der ikke er data for (må være fordi vi ikke har implementeret forretningsregler for beregningers kørselstidspunkter?)\n\nDe kan derved også eks. vælge perioder der overlapper to måneder, men hvor den valgte beregningstype kun er kørt for en del af den valgte periode, og brugeren får dermed kun data for den periode, beregningen er kørt for (logisk nok), men vi fortæller ikke brugeren, at det er fordi, beregningen endnu ikke er kørt for den anden del af perioden. \n\nDette kunne evt. løses ved, at man, når man har valgt beregningstype, ikke kan vælge perioder længere frem, end hvad der er kørt beregning for.\nMåske kunne vi simplificere valg af periode til at være faste måneder, når der er valgt engros, 1.,2.,3 korrektion? Så f.eks. Januar 2022?\nNår balancefiksering er valgt, skal man dog kunne vælge datoer.\n\nDet undersøges, om vi kan afgrænse datovælgeren til kun at kunne vælge hele måneder på engrosberegninger (Irene undersøger)\n\nUpdate: Det er ikke nødvendigt for brugerne at kunne vælge få datoer i en måned - så det er ok, at man skal vælge én hel måned (for engros, 1.2.,3 korr.)","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/944","status":"open","title":"UX issue på afregningsrapporter"},{"created":"2024-11-20T09:53:53Z","description":"Det skal være muligt at deaktivere en aktør, så de ikke uretmæssigt kan tilgå DH3\n\n**AC**\n- [ ] FAS skal have en proces for at sikre, at der ikke er relationer, der forhindrer en deaktivering\n- [ ] Det er kun FAS, der må deaktivere en aktør\n- [ ] Der sættes den korrekte statuskode (passiv, deaktiveret)\n- [ ] Statuskoden vises i UI\n\n\n\n\n\n-----------------------------------\n\nGenerelt:\n- En aktør kan ikke deaktivers hvis han ejer brugere (automatisk deaktivering af brugere)\n- Hvis GLN nummer som skal dø er brugeransvarlig: brugerne flyttes som databaserettelse over til det overlevende GLN nummer med samme emaildomæne. Øvrige brugere=tilknyttede brugerroller fjernes på det døende GLN. Hvis ikke at der findes en overlevende modtager af brugere skal disse brugere inaktiveres)\n- B2B forbindelse deaktiveres\n- Statusskifte på aktør\n- Rettigheder til deaktivering: actor-master-data:manage\n- Delegering fjernes\n\nNetvirksomhed:\n•\tEn netvirksomhed må ikke kunne inaktiveres hvis han er tilknyttet et netområde med målepunkter\n•\tEn netvirksomhed må ikke kunne inaktiveres hvis han ejer priselementer\n\nElleverandær:\n•\tEn elleverandør må ikke have målepunkter tilknyttet\n•\tEn elleverandør: Må ikke have Balanceansvarsrelationer \n•\tEn elleverandør skal stadigt indgå i engrosafregninger 3 år efter deaktiveringen\n\nBalanceansvarlig:\n•\tEn balanceansvarlig: Må ikke have Balanceansvarsrelationer\n\nDelegering:\n•\tAlle delegeringer fjernes\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/941","status":"open","title":"Det skal være muligt at deaktivere en aktør"},{"created":"2024-11-18T14:38:41Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/936","status":"open","title":"Udstille netområder til procesmotor"},{"created":"2024-11-18T14:36:30Z","description":"Når jeg har overtaget et netområde fra en anden netvirksomhed, må der ikke gå beskeder tabt\n\n**AC**\n- [ ] Alle beskeder relateret til det gamle netområde vil blive sendt til den netvirksomhed, som har overtaget, selv om det gamle netområde bevares som et selvstændigt område under den overtagende netvirksomhed. \n- [ ] Alle beskeder relateret til det gamle netområde vil blive sendt til den netvirksomhed, som har overtaget når de to netområder er slået sammen til et område\n- [ ] Hvis der ligger gamle uafhentede beskeder til den nedlagte netvirksomhed, skal de slettes","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/935","status":"open","title":"Sikring af, at alle beskeder relateret til det gamle netområde sendes til den nye netvirksomhed"},{"created":"2024-11-18T14:18:07Z","description":"Som bruger af beregninger og afregningsrapporter, skal jeg kunne vælge de relevante netområder for en given tidsperiode, så jeg selv kan få korrekte data, som jeg har ansvaret for, ud af Datahub 3\n\n**Acceptkriterier**\n- [ ] Når jeg bestiller en afregningsrapport, kan jeg kun vælge de netområder, som er aktive i hele eller dele af det tidsinterval rapporten er gældende for\n- [ ] Når jeg bestiller en afregningsrapport, kan jeg kun vælge de netområder, jeg er ansvarlig for \n\nTeknisk note: Vi skal have en \"tabel\" i DH3, der indeholder sammenlægninger \n\n- [ ] Når jeg anmoder om en beregning, kan jeg kun vælge de netområder, som er aktive i hele eller dele af det tidsinterval beregningen er gældende for\n- [ ] Når jeg anmoder om en beregning, kan jeg kun vælge de netområder, jeg er ansvarlig for og som er aktive i hele eller dele af det tidsinterval beregningen er gældende for\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/930","status":"open","title":"Vise relevante netområder i afregningsrapporter og anmodning om beregninger"},{"created":"2024-11-18T14:16:22Z","description":"Som administrativ bruger af DH3 skal det være muligt at initiere en sammenlægning af to netvirksomheder og evt. to netområder, så den ene netvirksomhed overtager ansvaret for netområdet fra den anden netvirsomhed og de to netområder sammenlægges evt. til et netområde.\n\n**Acceptkriterier**\n- [x] Den nedlagte netvirksomhed skal deaktiveres på et forudbestemt dato (ddmmyy), dog tidligst en uge fra oprettelsestidspunktet af sammenlægningen\n- [x] Den nedlagte netvirksomhed (aktør) deaktiveres kl. 23:59:59:99 dagen før\n- [x] Hvis de to netområder sammenlægges, skal det gamle netområde deaktiveres kl. 23:59:59:99 dagen før\n- [ ] Alle delegeringer opsat på det nedlagte/mergede netområde skal deaktiveres på det valgte tidspunkt jf. eksisterende regler for deaktivering af delegeringer\n- [x] Brugeradministrator på de to involverede netvirksomheder samt FAS notificeres om oprettelsen af sammenlægningen\n- [x] Der sendes et nærmere aftalt event til EDI domænet om sammenlægningen\n- [x] C4 diagram opdateres\n- [ ] Hændelsen gemmes i historikloggen på både den nedlagte og den tilbageværende aktør (netvirksomhed)\n- [x] Auditlog opdateres (aktivering af sammenlægning, deaktivering af brugere, netvirksomheder m.v.)\n\nhttps://www.figma.com/design/0OkBGHSPFBI3JovKN6A2F0/Sammenl%C3%A6g-akt%C3%B8rer?node-id=310-2492\u0026t=IOrIc2sjsgJSXAhs-1\n\n[Testscenarier](https://energinet.atlassian.net/wiki/spaces/DataHub/pages/1242660907/Testscenarier+til+akt+rsammenl+gning)","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/928","status":"open","title":"Foretag sammenlægning af netområder og/eller aktør"},{"created":"2024-11-15T07:26:58Z","description":"Confluenceside med udarbejdelse af kontrakt: https://energinet.atlassian.net/wiki/spaces/D3/pages/1208025089/Kontrakter\n\nELVARME\nMandalorian (Measures) skal vide når følgende sker og alle målepunkter skal have elvarme i perioden:\na) Oprettelse eller tilslutning af elvarme til målepunkt.\n   - Tilslutning af elvarme sker gennem indrapportering fra elleverandør, og derfor har vi ElectricalHeating på en CustomerRelation.\n   - Elvarmeperioden kan blive ændret tilbage i tid.\n   - Oprettelse af nyt målepunkt med elvarme burde også være dækket af denne tabel.\nb) Skifte af elleverandør på målepunktet.\n   - Sker når en elleverandør bliver skiftet, angivet ved ny CommercialRelation og tilretning af StartDate/EndDate.\n   - Hvis kunden skifter, men elleverandør gør ikke, så ændres der ikke i CommercialRelation.\nc) Fejlskifte af elleverandør på målepunkt.\n   - Historisk rettelse af CommercialRelation.\n   - Mangler vi temporal fields på CommercialRelation?\nd) Tilflytning af en kunde.\n   - Sker når en kunde tilflytter eller overtager en eksisterende elleverandør.\n   - Data står i EnergySupplierPeriod, men synes navnet passer dårligt. Forslag:\n\t* EnergySupplierPeriod bliver til SupplyPeriod. SupplyPeriod references one or more Customers.\n        * Contact bliver til Customer.\n        * Customer bliver til CustomerIdentity.\n        * Så det bliver til: Metering Point has a CommercialRelation, which specifies an energy supplier. EnergySupplier supplies power in the SupplyPeriod to one or more Customers. A Customer is built as a contact info and a CustomerIdentity.\ne) Fejltilflytning af en kunde.\n   - Historisk rettelse i EnergySupplierPeriod/SupplyPeriod tabellen.\nf) Ændring af NetSettlementGroup.\n   - Ændring og historisk rettelse af NetSettlementGroup, givet i MeteringPointPeriod.\n   - Tabellen er allerede temporal.\ng) Når en child-målepunkt bliver tilknyttet/fjernet, kun når NetSettlementGroup er lig 2.\n   - Givet ved ParentMeteringPointId i MetereingPointPeriod.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/921","status":"open","title":"Fastsættelse af kontrakt med Elvarme"},{"created":"2024-11-15T07:11:10Z","description":"Til validering af måledata har Mosaic behov for at kunne trække målepunktsdata dagligt.\n\n5 mio transaktioner om dagen\nKan komme i bulks, så skal performe meget hurtigt\nVil helst trække fra SQL\nVil gerne i første omgang have 10 mio målepunktsid'er udstillet, så de kan begynde at performanceteste","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/915","status":"open","title":"Udstilling af målepunktsstamdata til procesmotoren"},{"created":"2024-11-11T09:58:29Z","description":"GraphQL bruger query/mutation utility\nSignals er implementeret i nedenstående områder\n\n**AC**\n- [ ] Market Participants\n- [ ] Brugeradmin","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/912","status":"open","title":"Implementere signals og queries i frontend på tværs af kodebasen"},{"created":"2024-11-08T10:28:24Z","description":"Til beregning af afgifter på elvarme, har jeg behov for at få stamdata udstillet, så beregningen kan foretages korrekt\n\n**Behov**\n- Skal kunne trække 350.000 elvarmemålepunkter (childmålepunkter og parent)\n- Trækkes en gang om dagen, så det er ikke vigtigt, at det performer så hurtigt som f.eks. procesmotoren\n- Vil helst trække fra unity catalog\n\n**Afgrænsning**\n- \n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/911","status":"open","title":"Udstilling af målepunktsstamdata til beregning af elvarmeafgifter"},{"created":"2024-11-07T11:41:23Z","description":"Som Energistyrelse, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- \n\n**Afgrænsning**\n-  Udskudt på ubestemt tid - Ligger ved Mads Bro\n\n**Nye ønsker**\n- ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/908","status":"open","title":"Visning af målepunktsstamdata som STS/Energistyrelsen"},{"created":"2024-11-07T11:41:17Z","description":"Som SYO, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- Jeg har behov for at kunne se priser, når jeg laver beregninger\n- Jeg har behov for at se stamdata, når skal lave kontroller\n- Jeg har behov for at se forretningsprocesser, når skal lave kontroller\n- Jeg har behov for at se historik, når skal lave kontroller\n\n**Disse fem behov skal ud af denne story - og over i de procesproduktmål, der ligger i \"fase 3\"**\n- Jeg har behov for at fjerne flaget for \"aftagepligt\"\n- Jeg har behov for at rette priser\n- Jeg har behov for at rette tilknytning af priser (prislinks)\n- Jeg har behov for at melde en pris ind\n- Jeg har behov for at kunne anmode om data\n\n**Afgrænsning**\n- Kan ikke se forretningstransaktioner (leverandørskifte m.v.) - IKKE KORREKT (CCO)\n- Kan ikke se historikfanen - IKKE KORREKT (CCO)\n\n**Nye ønsker**\n- ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/907","status":"open","title":"Visning af målepunktsstamdata som Systemoperatør (SYO)"},{"created":"2024-11-07T11:39:57Z","description":"Som Delegeret, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- \n\n**Afgrænsning**\n- Må ikke se data i GUI\n\n**Nye ønsker**\n- ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/906","status":"open","title":"Visning af målepunktsstamdata som Delegeret"},{"created":"2024-11-07T11:39:28Z","description":"Som FAS, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- Hvis slutkunde, elleverandør eller netvirksomhed har spørgsmål til målepunktet - typisk ved fejlscenarier\nPERNILLE SIDDE EN DAG VED SIDEN AF ULLA EN DAG\n\n**Afgrænsning**\n- Rettighedsstyring på CPR søgning (Se CPR som elleverandør brugerrolle)\n- Skal ikke kunne initiere processer i GUI (fase 3)\n\n**Nye ønsker**\n- Søge målernummer\n- Kundenavn skal vises på søgeresultat (liste), gerne som mouse-over, da der ofte er f.eks. elmaster og kundemålepunkter på samme adresse. Skal kun vises som FAS og ejer af målepunktet (elleverandør)\n- \"Vaskbar\"/\"ikke-vaskbar\" vises på søgeresultatet (liste), gerne mouse-over af målepunkter ved søgning\n- \"Hemmelig adresse\"-markering skal være mere synlig\n- \"Elleverandør siden\" viser i dag hvornår elleverandøren overtog målepunktet (selv om der har været flere kundeforhold) - må gerne ændres til aktuelt kundeforhold med aktuel elleverandør\n- Det skal være muligt at folde \"alle\" oplysninger ud på alle \"områder\" - også f.eks. Priselementer\n- Sammenligning af historik på to perioder er ikke hensigtsmæssig\n- Der skal klikkes rigtigt meget i dag, det er vanskeligt at navigere og finde oplysninger\n- Kan man gemme søgekriterier, så de huskes næste gang?\n- Ved søgning på adresse, kunne det være godt at kunne søge f.eks. husnummer 3* (så alle, der starter med 3 vises)\n- Kan man anvende * som wildcard i søgeparameter i stedet for %\n- Kan man sammenligne to målepunkts på en skærm? F.eks. forbrugs- og produktionsmålepunkt (nice-to-have)\n- Kan det være at kunne vælge/fravælge inaktive målepunkter\n- Det skal være muligt at se en detaljeret historik, herunder skift af elleverandør, skift af kunde, skift af elvarme etc. \n- Det skal markeres, om CPR er reel eller dummy. Der skal være helt klare regler omkring dette. (Skal over TI)\n- Erhvervskunder skal tjekkes mod CVR, vi har allerede en løsning ved aktøroprettelse og -vedlighold (skal over TI)","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/905","status":"open","title":"Visning af målepunktsstamdata som FAS"},{"created":"2024-11-07T11:38:29Z","description":"Som netvirksomhed, der ejer netområdet, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- Jeg slår op i Datahub, hvor de korrekte målepunktsstamdata findes, hvis jeg er i tvivl om, om data i eget system er korrekte\n- Jeg har behov for at se, at kundestamdata er korrekte\n\n**Afgrænsning**\n- Netvirksomhed må kun se målepunkter i eget netområde\n- Netvirksomhed må ikke kunne se CPR\n- Netvirksomhed må ikke se elleverandør (hverken aktuel eller historisk)\n\n**Nye ønsker**\n- Søgning på GSRN nummer (afklar med Mads Bro)\n- Hvis jeg står på et childmålepunkt, skal det være muligt at se tidligere tilknytninger til parent målepunkter (Jean kan forklare yderligere)\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/904","status":"open","title":"Visning af målepunktsstamdata for netvirksomhed, der ejer netområdet"},{"created":"2024-11-07T11:19:53Z","description":"Som elleverandør, der _ikke_ har leverancen for målepunktet, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- Jeg er i dialog med kunden om en aftale.\n- Jeg undersøger hvad årsagen er til, at jeg ikke er leverandør mere\n- Jeg skal undersøge fejl i stamdata (f.eks. en etageejendom, hvor målernr. i systemet ikke matcher målernr. på lokationen)\n\n**Systemmæssigt behov**\n- Systemet skal imøde fusk (forsøg på at stjæle andres kunder)\n\n**Afgrænsning**\n- Jeg må kun kunne se de processer, jeg selv er en del af\n- Jeg må kun se historikken for de perioder, hvor jeg har ejet målepunktet\n- CPR numre må ikke vises\n- Jeg må ikke kunne udsøge kunder, der har hemmelig adressse\n- Jeg må ikke se detaljeret forbrug\n- Jeg må ikke se email\n- Jeg må ikke se telefonnummer\n\n\n**Nye ønsker**\n- Angivelse af årsag til opslag","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/903","status":"open","title":"Visning af målepunktsstamdata for elleverandør, der ikke har leverancen for målepunktet"},{"created":"2024-11-07T11:07:43Z","description":"Som elleverandør, der har leverancen for målepunktet, har jeg behov for at kunne søge og få vist data om målepunktet. \n\n**Behov**\n- Jeg slår op i Datahub, hvor de korrekte målepunktsstamdata findes, hvis jeg er i tvivl om, om data i eget system er korrekte.\n- Jeg slår op i Datahub, for at kunne se historik på målepunkterne\n- Jeg slår op i Datahub, for at kunne se flytninger (også fremtidige)\n\n**Afgrænsning**\n- Jeg må kun kunne se de processer, jeg selv er en del af\n- Jeg må kun se historikken for de perioder, hvor jeg har ejet målepunktet\n- Visning af CPR numre skal begrænses (afklares med Julie)\n\n**Nye ønsker**\n- Det skal være muligt at søge på målernr\n- Historikvisningen skal \"være bedre\" end i dag\n- Kundenavn skal vises på søgeresultat (liste), gerne som mouse-over, da der ofte er f.eks. elmaster og kundemålepunkter på samme adresse. Skal kun vises som FAS og ejer af målepunktet (elleverandør)\n- \"Vaskbar\"/\"ikke-vaskbar\" vises på søgeresultatet (liste) af målepunkter ved søgning","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/902","status":"open","title":"Visning af målepunktsstamdata for elleverandør, der har leverancen for målepunktet"},{"created":"2024-10-31T11:59:50Z","description":"Efter implementering af mulighed for tilknytning af MitID-login som supplement, har jeg en række ønsker/forslag til øget brugervenlighed, som også vil reducere mængden af potentielle henvendelser til DataHub Support.\n\n\n1) Det er kun professionelle aktører i elmarkedet, der er oprettet som bruger, som kan logge på DataHub 3.0.\nIdet der ikke er adgangsbegrænsning via whitelisting af IP-adresser, kan alle fremsøge loginsiden.\nMange elkunder og tredjeparter forveksler ElOverblik med DataHub, og tror fejlagtigt, at de skal logge på DataHub.\nForslag til hjælpetekst på loginsiden:\n\"Det er kun registrerede brugere, der manuelt har aktiveret muligheden for MitID-login i deres profil, der kan logge på DataHub 3.0 PREPROD med MitID på vegne af deres virksomhed. Er du elkunde eller tredjepart, kan du få adgang til data via ElOverblik.\" eller \"Adgang til data på vegne af din organisation kræver at du har aktiveret MitID-login via din profil OG har et CVR-nummer knyttet til dit MitID.\"\n\n2) Undgå at oprettede brugere forsøger at tilknytte deres (rent) private MitID.\nForslag til hjælpetekst ved siden af Tilknyt MitID-knappen på brugerprofil-siden:\n\"Vær opmærksom på at det ikke er muligt at tilknytte et privat MitID uden CVR-nummer-adgang.\"\n\n3) En bruger, der har tilknyttet MitID-login til sin profil, forsøger at logge på med sit private MitID med flere CVR-nummer tilknyttet eller ét af flere MitID Erhverv, og vælger det forkerte CVR-nummer.\nForslag til fejlbesked:\n\"Kontrollér at du benytter dét samme MitID, som du har har brugt ved tilknytning af MitID-login\".\n\nVi kan med fordel også beskrive, hvordan man kan nulstille sin MitID-adgang.\n\n\n\n\n\n\n\n\n\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/899","status":"open","title":"MitID - forslag til øget brugervenlighed"},{"created":"2024-10-31T09:56:51Z","description":"Det skal være muligt at udsøge målepunkter. \n\nKontaktpersoner: Joachim, Torben, Irene\n\nVi har følgende til rådighed\nProduktmål: https://app.zenhub.com/workspaces/product-goal-board-6375df2fd6f08e0015e1e0e6/issues/gh/energinet-datahub/internal-repo/1310 - bliver flyttet til https://energinet.atlassian.net/wiki/spaces/D3/pages/1174798338/PM41+M+lepunktsstamdata\n\nMiro: https://miro.com/app/board/uXjVLaH7jfY=/\n\nFigma: https://www.figma.com/proto/4tVkjKm5fkIj61nx4XD3pA/DataHub-3.0?node-id=4212-54218\u0026starting-point-node-id=4212%3A54218\n\nConfluence: https://energinet.atlassian.net/wiki/spaces/D3/pages/1178927123/Frems+g+m+lepunkter\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/898","status":"open","title":"UX - Målepunkter (PM41)"},{"created":"2024-10-31T08:48:07Z","description":"Miljø: https://dev002.datahub3.dk/\nBrowser: Firefox (132)\nAktør: DataHub Systemadmin\n\nNOTE: SØG MARKPART IGENNEM FOR AT SE, OM DER ER ANDRE TEKSTER, DER IKKE ER OVERSAT.\n\nDer mangler tekster til fejlbeskeder når man opretter en ny organisation.\n\n1. Hvis organisationen man forsøger at oprette, er blevet oprettet i samme flow, fx. pga. fejludfyldte felter i aktørformularen:\n\n\u003cimg width=\"1072\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMW1JQnc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--ce0fdd3ac31677882c9986d50eb350e9a46b5ddb/cvr-opslag.png\" alt=\"cvr-opslag.png\" /\u003e\n\n2. Hvis organisationsnavn mangler (vil vel kun ske hvis CVR-opslaget ikke kan gennemføres) :\n\n\u003cimg width=\"1216\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMXFJQnc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--a3d8b0a25041ce895ab9c64ab805ace1c3fabcff/manglende-tekster.png\" alt=\"manglende-tekster.png\" /\u003e\n\n3. Hvis aktørnavn er for langt (over 51) er der heller ikke oversættelse - på siden \"Opret/Rediger aktør\"","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/897","status":"open","title":"Manglende tekster til fejlbeskeder ved oprettelse af organisation"},{"created":"2024-10-30T09:18:19Z","description":"\u003cimg width=\"771\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBeHlEQnc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--543d44dacada1293b0c845285d7276555e4b3b83/Screenshot%202024-10-30%20at%2010.16.49.png\" alt=\"Screenshot 2024-10-30 at 10.16.49.png\" /\u003e\n\nFeedback fra Irene: Man overser den checkbox, når den står under checkbox med Datagrundlag.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/888","status":"open","title":"Flyt checkbox 'Tillad store filer'"},{"created":"2024-10-10T07:26:47Z","description":"Der ønskes en didekeret queue til notifications. \n\nCore pakken kan i dag ikke sende til andre topics end integrationstopic. Hvis forslaget skal laves, så erstattes topic af en kø\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/880","status":"open","title":"Notifications: Udvid Core-pakke til at sende notifications over i en kø (Forslag)"},{"created":"2024-10-10T07:25:56Z","description":"Tilføj Protobuf kontract til Core-package (hvor?) + dokumentation.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/879","status":"open","title":"Notifications: protobuf i Core-pakke. (Forslag)"},{"created":"2024-10-03T12:17:03Z","description":"I henhold til reglerne i GDPR skal data slettes i Mark Part. Følgende regler ønskes implementeret\n\nFølgende oplæg er lavet af Dorte og Rasmus omkring sletteregler\n[Oplæg til beslutningsnotat vedr audit-log.docx](https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBN3dkQnc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--a421f5e53efa1419a63f729e6807ab965111a604/Opl%C3%A6g%20til%20beslutningsnotat%20vedr%20audit-log.docx)\n\n**AC**\n- [ ] Anonymisering er implementeret på Organisationer\n- [ ] Anonymisering er implementeret på Aktører\n- [ ] Anonymisering er implementeret på Brugerrroller\n- [ ] Anonymisering er implementeret på Rettigheder\n- [ ] Anonymisering er implementeret på Brugere\n- [ ] Sletning er implementeret på Organisationer\n- [ ] Sletning er implementeret på Aktører\n- [ ] Sletning er implementeret på Brugerrroller\n- [ ] Sletning er implementeret på Rettigheder\n- [ ] Sletning er implementeret på Brugere\n- [ ] Handlingerne registreres i audit log\n- [ ] Det skal dokumenteres, hvordan ældre data skal anonymiseres/slettes ved en restore\n- [ ] Både anonymesering og sletning foretages mindst en gang om måneden\n- [ ] Anonymesing af data, der er ældre end 6 mdr og 1 dag\n- [ ] Sletning af data, der er ældre end 18 mdr. og 1 dag\n\nTeknisk note: For at kunne teste det, skal det være muligt at ændre perioden (for ikke at skulle vente unødigt lang tid)\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/873","status":"open","title":"Implementere sletteregler i Mark Part"},{"created":"2024-10-03T08:02:28Z","description":"Timebox: 1 dag\n\nDH3 Opeations UI kanal indeholder ikke BFF fejl","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/870","status":"open","title":"Teams kanal til BFF UI fejl "},{"created":"2024-09-30T12:40:50Z","description":"Formatet på csv-filerne skal følge sproget i UI på DH3\n\nAC\n- [ ] Hvis jeg tilgår DH3 med engelsk interface, skal formatet på csv filen være engelsk format\n- [ ] Hvis jeg tilgår DH3 med dansk interface, skal formatet på csv filen være dansk format","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/866","status":"open","title":"Format på csv filer skal følge valgt sprog på DH3 UI"},{"created":"2024-09-18T10:20:21Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/847","status":"open","title":"Vedligehold frontend 2024"},{"created":"2024-09-18T10:06:42Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/846","status":"open","title":"Vedligehold Øvrigt Raccoons 2024"},{"created":"2024-09-18T10:06:06Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/845","status":"open","title":"Vedligehold Afregningsrapporter 2024"},{"created":"2024-09-18T10:05:54Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/844","status":"open","title":"Vedligehold eSett 2024"},{"created":"2024-09-18T10:05:12Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/843","status":"open","title":"Vedligehold Market Participant 2024 "},{"created":"2024-09-10T12:42:15Z","description":"JMG 2/12: Denne story er blokkeret indtil Raccoons ikke længere har support for option 1\nBJM 10/9: Denne story er blokkeret indtil alle miljøer kører på option 2.\n\n## Acceptance Criteria\n\n- [ ] Wholesales dataprodukt for settlement reports er slettet","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/825","status":"open","title":"Slet settlement reports data produkt"},{"created":"2024-09-10T12:11:45Z","description":"# User story\nSom dev team\nvil vi opdatere vores C4 diagrammer\nså diagrammerne altid fortæller et \"as is\" billede \n\n## Acceptance Criteria\n\n- [ ] Settlement C4 diagram er opdateret i både settlement og dh3infrastructure repos\n\nSom hjælp se arkitekturtegningen [her](https://miro.com/app/board/uXjVKmsP8NA=/).\n\n# Documentation\nn/a\n\n# Testing\nn/a","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/819","status":"open","title":"Opdatér settlement reports C4"},{"created":"2024-09-05T13:30:55Z","description":"Hvis man anvender DataHub på engelsk ser man brugerroller med navn og beskrivelse på dansk. \nDer skal tilføjes mulighed for at oprette navn og beskrivelse på både dansk og engelsk.\n\nAC:\n\n- [ ] Oprettelse af brugerroller skal indeholde felter til danske og engelske tekster\n\n\u003cimg width=\"1618\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBNkd5Qmc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--329398f04b446ed3bf4f5b0f1e2d46c45af495de/brugerroller-dansk.PNG\" alt=\"brugerroller-dansk.PNG\" /\u003e\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/803","status":"open","title":"Understøttelse af engelsk i brugerroller"},{"created":"2024-08-14T12:08:31Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/758","status":"open","title":"Mangler oversættelse på fejl"},{"created":"2024-08-07T11:55:30Z","description":"Problem: Den samme domæneadresse kan ikke genbruges på tværs af flere forskellige organisationer.\nLøsning: Dette er en større ændring i Datahub (for hvem ’ejer’ så brugeren hvis han skal deaktiveres?).\n\nDer er et behov for, at domæne kan tilknyttes flere organisationer, da der er brugere fra samme virksomhed (med et maildomæne), som er tilknyttet forskellige organisationer i Datahub.\n\n**AC**\n- [ ] Det skal være muligt at knytte et domæne til flere organisationer i Datahub\n- [ ] Det skal være tydeligt, hvem der er primær ansvarlig for en bruger (har hidtil været styret på domænet/organisationen","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/749","status":"open","title":"Det skal være muligt at et domæne kan bruges på flere organsiationer"},{"created":"2024-07-02T06:17:10Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/737","status":"open","title":"Dokumentation af notifikationer"},{"created":"2024-07-01T11:02:55Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/733","status":"open","title":"Brugerrollens beskrivelse skal vises i oversigtslisten"},{"created":"2024-06-04T13:24:07Z","description":"Som DataHub 3 skal jeg kunne være i stand til at modtage data i et aftalt format, danne en RSM-012 tidsserie og sende den til DH2\n\nBaggrund:\nNote: det er en midlertidig løsning. **Tidshorisont: Start nytår**.\nBaseret på de 10 største dagsværdier i et netområde beregnes et gennemsnit til videre fakturering. Disse værdier opsamles udenfor DH3 (Ivan) og skal ind i DH3, der derefter sender dem videre til DH2.\nIvan kan ikke sende RSM-012 mod DH2 da han så skal have et certifikat for hvert netområde. Vi genbruger derfor delvist  løsningen omkring nettab/systemkorrektion (DH2 Bridge)\n\nIndholdet til D19 RSM-012 tidsserierne beregnes udenfor DH3. Et views/event i DH3 er ikke muligt, hvorfor beskederne skal dannes, når den køres manuelt af \"driften\" via vieweren. Vieweren danner et jSon format som indeholder informationer om de data der skal hentes ud og som er grundlaget til en RSM-012.\nVi skal have aftalt et ønsket format/leveringsmåde hvorved DH3 kan få de nødvendige data til at kunne danne RSM-012 og sende mod DH2. Vi genbruger DH2 bridge (som ved nettab og systemkorrektion).\nMan skal forvente at der er ca 2100 MP, hvor der skal generes en RSM-012 pr målepunkt for en hele måned. RSM-012 skal indeholder følgende:\n\nMP 5713131.......\nstart (fx) 2024-04-30 22:00\nEnd  (fx) 2024-05-31 22:00 \n(31 dage x 24 positioner, hvor der er værdi i den første position og 0  i de resterende 23 positioner pr dag)\nKvalitet er beregnet QuantityQuality\tD01\tBeregnet \nResolution time\nAfsender DH3\nModtager DH2\n\nIvan udarbejder en jSon fil, hvor disse informationer skal hentes fra.\n\nAC:\n- [ ] Enighed med Racoons/Ivan om leveringsmetode uden views\n- [ ] Enighed med Racoons/Ivan om ønsket format, hvor Ivan starter med et jSon format\n- [ ] DH3 kan danne RSM-012 baseret på de modtagne data\n- [ ] Den modtagne (beregnede) værdi skal placeres i position 1 og de efterfølgende 23 positioner skal være 0'er\n- [ ] DH3 kan sende RSM-012 til DH2 (vi bruger DH2 bridge)\n- [ ] Fejl håndteres på samme måde som ved nettab/systemkorr afendelserne (mail)\n- [ ] Genindsendelse hvis DH2 ikke svarer\n- [ ] Nyt besked ID hvis beskeden afvises i DH2 (synkron/asynkron), så vi kan sende igen\n- [ ] Logning af besked ud fra DH3 til DH2 pga auditloggen\n\n\nTest mod PRE07 hvis muligt, da testscenarierne er bygget op her.  ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/726","status":"open","title":"EffektRSM-012 tidsserie fra DH3 til DH2 D19 målepunkter"},{"created":"2024-06-03T13:17:04Z","description":"Som ansvarlig for revisionssporet har jeg behov for at sikre, at søgninger bliver gemt og overholder GDPR- kravene, så vi er kompliant på dette område.\n\n**AC**\n- [ ] Logning af på brugere bliver gemt centralt med oplysning om hvilken søgning, der er lavet, hvem, der har lavet ændringen og hvornår ændringen er lavet jf. retningslinjerne på https://energinet.atlassian.net/wiki/spaces/D3/pages/736362528/GDPR+Catalog\n- [ ] Det må ikke være muligt for en datahub bruger at ændre i data i loggen\n- [ ] Brugeren, der har lavet søgningen anonymiseres efter et halvt år, således det kun fremgår hvilken aktør og organisation brugeren tilhører. I nedenstående eksempel ændres \"Alexei (aiu@energinet.dk)\" til aktørnavnet, organisationsnavnet\n- [ ] Selve søgestrengen xxxxxx\n\n\u003cimg width=\"2000\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBL2N1QlE9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--f6517e567c4579184c1488fd6894368050ea1d4d/image.png\" alt=\"image.png\" /\u003e\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/675","status":"open","title":"Auditlog - Søgning"},{"created":"2024-05-30T08:28:37Z","description":"Look into if would provide value to implement a federated schema for our sub systems, and find out how long it would take to implement it.\n\nhttps://chillicream.com/docs/hotchocolate/v13/distributed-schema/schema-federations","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/665","status":"open","title":"Timebox: Investigate if federated gateway can provide value"},{"created":"2024-05-23T08:58:55Z","description":"Når man i dag opsætter delegering, så kan man se opsætningen på den aktør som delgerer sine beskeder. \n\nØnske: (Khatozen) Det skal være muligt at se delegeringsforholdet på den aktør man delegerer til. \n\nJeg tænker der skal laves noget mere reinement incl UX design, hvor de helt specifikke krav afklares.\n\n\nDer skal laves lidt ændringer til kolonneoverskrift 'Delegeret'.\nPå en aktør som har delegeret meddelelser er overskriften 'Delegeret til'\nPå en aktør som er delegeret er overskriften 'Delegeret fra'\nhttps://www.figma.com/design/W40iJ3OwBIYzrRbRlcH6tL/Delegering-af-udg%C3%A5ende%2Findg%C3%A5ende-beskeder?node-id=1399-14075\u0026t=uJIvv6xi8APpkUSZ-1\nDet skal ikke være muligt at administrere delegering fra delegeret aktør\nDet er ikke muligt at opsætte delegering for andre beskedtyper, selvom aktør kun er delegeret for et begrænset antal beskedtyper.\nDvs. reglen er, at er aktør delegeret, kan de ikke delegere. ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/656","status":"open","title":"Delegeringsforhold skal kunne ses på både den aktør der delegerer og den de delegere til"},{"created":"2024-05-17T08:23:00Z","description":"Timebox: 1 dag 1 udvikler\n\nEr det muligt, slå nogle af methoderne samme i dataloader ved at bytte generic ellers interfaces from parent","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/650","status":"open","title":"Undersøg: Interface/Generic parent på dataloader"},{"created":"2024-05-14T11:11:55Z","description":"\n**AC**\n\n- [ ] BFF er re-factored til iOptions patterns","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/641","status":"open","title":"Refactorering af BFF til iOptions patterns"},{"created":"2024-05-03T06:57:27Z","description":"Der har tidligere være en opgave, hvor Dorthe ønskede, at man kunne søge på tværs af kolonner på brugerroller tab under brugeradministration (en **og** søgning). \nMen hvis det ikke bliver sådan på tværs af hele DH3, vil hun hellere undvære. \nDerfor skal vi undersøge, hvordan søgning er implementeret i andre lister i DH3, og finde ud af, hvad vi kan understøtte generelt. ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/634","status":"open","title":"Undersøg hvordan søgning fungerer på listen på tværs af DH3"},{"created":"2024-04-19T10:34:34Z","description":"Severity: High, potentiel sikkerhedsrisk. \n\nJeg har gennem UI'en tilknyttet mnit MitID, og bruger det efterfølgende til at logge ind i datahub. \n\nLogger ud via knappen i profilmenu'en. \n\nÅber DataHub igen, og vælger Log ind med MitID, \n\nForventet opførsel: Jeg skal angive credentials igen,\nAktuel opførsel: bliver jeg ikke spurgt om credentials. \n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/624","status":"open","title":"Log af Datahub logger ikke af, hvis man i første omgang loggede ind med MitId"},{"created":"2024-04-18T12:19:18Z","description":"**Brugere**\n* DataHub support\n\n\n**Behov og eksempler på dette kan være**\n* Skal sende en informationsmail ud til default kontakten på alle aktører (DataHub support)\n* Sammenholde information for DataHub 2 og DataHub 3, for at sikre, at vi har ens data i de to systemer (DataHub support). Dette kunne være information på organisationer og aktører.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/621","status":"open","title":"Koncept for rapporter"},{"created":"2024-04-09T14:54:57Z","description":"Ejeren af netområde 995 i DH3 PROD er 50 hertz nettet.\nDet bør være 'Energinet Systemansvar' (som så mange andre af specialnetområderne)\n\n**AC**\n- [ ] Ejer er sat til at være \"Energinet Systemansvar\"\n- [ ] Data skal sendes og modtages af øvrige sub-systemer\n- [ ] 1) Lav eventet først, og skriv/vis det til Mosaic, så de kan validere, om det virker.\n- [ ] 2) Ret markpart, ret eSett, send eventet over SB.\n- [ ] 3) Kontroller med Mosaic, at modtagelsen virker og der er ikke nogen deadletters.\n\nTekniske noter:\nDer skal laves et event og udsendes fra markpart\nInden vi gør det, skal det sendes til Mosaic, så de kan validere om det virker hos dem\nSom det er nu, så vil eSett crasche, da der vil være dubletter - skal håndteres","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/721","status":"open","title":"PROD: Ændring af netvirksomhed på netområde 995"},{"created":"2024-04-04T12:49:07Z","description":"Det skal være muligt at deaktivere en aktør, så aktøren ikke kan få tilknyttet målepunkter. De første tre år skal aktøren være passiv, da der kan komme korrektioner i tre år. Dernæst skal aktøren være inaktiv i fem år af hensyn til revisionsspor.\n\nEndeligt skal aktøren slettes efter de fem år, men det er ikke en del af denne feature.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/606","status":"open","title":"Deaktivering af en aktør"},{"created":"2024-04-04T09:11:28Z","description":"### Synopsis\nSom en Energinet admin bruger skal jeg kunne ændre status på en aktør til 'inaktiv'\n\n### Acceptance Criteria\nScenarie - aktørstatus passiv-\u003einaktiv. Automatisk efter 3 års som passiv.\n- [ ] Hvis en bruger kun er tilknyttet denne aktør skal brugeren deaktiveres.\n- [ ] Er brugeren tilknyttet flere aktører skal relationen til den inaktiverede aktør fjernes?\nHvad gør vi med en bruger hvis den inaktiverede aktør var den primære aktør?\n- [ ] Der skal være en sigende meddelelse, hvis aktøren ikke kan inaktiveres\n- [ ] Ændring skal logges i revisions-sporet (indtil den generelle sletning efter yderligere 5 år)\n- [ ] GLN skal ikke frigøres, heller ikke markedsrollen. \n- [ ] Ny status følger med (-\u003einaktiv)\n- [ ] Health Checks er opdaterede (DoD)\n- [ ] C4 diagrammer (DoD)\n\nNote: Organisationer slettes efter 8 år (hvis der ikke er aktører tilknyttet. Status passiv/inaktiv ikke relevant her).\n\n\nhttps://www.figma.com/file/f3NTPECK1OGKwkGJGIi3dL/Organisation-og-akt%C3%B8rer?type=design\u0026node-id=1289-6354\u0026mode=design\u0026t=IEYsF0qS44ng0uM8-4\n\n### Tech. Notes\nStart på UI ligger i en frontend branch: xkama/deactivate-actor\n\n#### Testability\n- [ ] Can be tested?\n- [ ] Can be demoed?\n- [ ] Verified by UX\n\n#### How to testEnviroment:User:Senario:\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/725","status":"open","title":"Aktørstatus passiv-\u003einaktiv"},{"created":"2024-04-02T07:50:20Z","description":"Timebox: ½ mandedag for at finde ud af, om der er en generel løsning\n\nDer er fundet følgende code scanning alerts der skal tages stilling til:\n\n**Søgning**:\nhttps://github.com/orgs/Energinet-DataHub/security/alerts/code-scanning?query=is%3Aopen+repo%3Agreenforce-frontend+Cross-site\n\nFølgende links er gældende for **MarketParticipantClient**.\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/43\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/34\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/29\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/24\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/42\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/31\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/28\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/36\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/30\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/26\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/21\nhttps://github.com/Energinet-DataHub/greenforce-frontend/security/code-scanning/20","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/595","status":"open","title":"Code scanning alerts"},{"created":"2024-03-15T07:22:53Z","description":"1 udvikler 4 timer\n\nSom medlem af Einstein vil jeg gerne se, hvordan Datahub 3 (Markpart) performer via standardfunktionalitet i Azure DevOps\n\n**AC**\n- [ ] Der er sat et Dashboard op, som Einstein har adgang til\n- [ ] Dashboardet indeholder funktionalitet, der understøtter at performance af Markpart kan overvåges\n- [ ] De overvågningsalarmer, der er ønsket i story #401 er forsøgt tænkt ind i løsningen\n\n\nTænk disse ønsker ind i løsningen\nhttps://app.zenhub.com/workspaces/raccoons-640aef0205a42b0ce978b829/issues/gh/energinet-datahub/team-raccoons/401","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/555","status":"open","title":"Timebox: Opsætning af Azure Dashboard til Einstein"},{"created":"2024-03-07T11:00:48Z","description":"Vi skal have afklaret hvordan vi fortæller brugeren er ved eller har inviteret en bruger der ikke eksistere i systemet til en aktør.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/551","status":"open","title":"UX issue i invitere af bruger"},{"created":"2024-03-05T12:38:44Z","description":"DH 3 skal overholde GDPR retningslinjerne for opbevaring, tilvejebringelse og sletning af data. \n\nEnerginet retningslinjer: [Retningslinje for logning og overvågning.docx](https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBN3p2QXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--2b2b926966919487611c2fa3f5a7fcc736a82f0a/Retningslinje%20for%20logning%20og%20overv%C3%A5gning.docx)\n\n\n- [ ] ","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/546","status":"open","title":"GDPR på Market Participants og eSett"},{"created":"2024-02-27T07:53:52Z","description":"\u003cimg width=\"1794\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBM2VRQXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--ad092299136e194c5b46826c9f5e2aba653ab4da/Screenshot%202024-02-27%20at%2008.54.38.png\" alt=\"Screenshot 2024-02-27 at 08.54.38.png\" /\u003e\nLøsningsforslag: Kunne vi helt droppe, at man kan vælge mellem eksisterende organisationer? Så vi selv finder ud af, om vi har organisationen ud fra det indtastede CVR/virksomheds-ID?\n\nhttps://www.figma.com/file/f3NTPECK1OGKwkGJGIi3dL/Organisation-og-akt%C3%B8rer?type=design\u0026node-id=1710%3A8171\u0026mode=design\u0026t=eGnjePuzlrpvToNJ-1\n\n---\n\n\u003cimg width=\"1444\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBM21RQXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--902382fc8a729b9c360c5496065937c3c6f2496a/Screenshot%202024-02-27%20at%2008.58.24.png\" alt=\"Screenshot 2024-02-27 at 08.58.24.png\" /\u003e\n\n\u003cimg width=\"756\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBM3VRQXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--3a01d0c0cc67e6b42035e7ba97207c77634bb09b/Screenshot%202024-02-27%20at%2008.58.48.png\" alt=\"Screenshot 2024-02-27 at 08.58.48.png\" /\u003e\n\n\u003cimg width=\"920\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBM3FRQXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--eadaf9f5333c3e2dd963e7a83b7b94e9f59ac376/Screenshot%202024-02-27%20at%2008.58.35.png\" alt=\"Screenshot 2024-02-27 at 08.58.35.png\" /\u003e\n\n\u003cimg width=\"640\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBM3lRQXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--2ac5a4575f26664001f552456486fdad33f76358/Screenshot%202024-02-27%20at%2008.59.04.png\" alt=\"Screenshot 2024-02-27 at 08.59.04.png\" /\u003e\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/529","status":"open","title":"UX opgaver fra UX review"},{"created":"2024-02-26T13:29:05Z","description":"En del små UI rettelser. De fleste vedrører 'bare' æstetik. \nhttps://www.figma.com/file/RtPNDzY64YytPvmBDI73Gl/UX-Review?type=design\u0026node-id=50%3A298\u0026mode=design\u0026t=okZkxguvMJGOwEZz-1","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/525","status":"open","title":"UI rettelser"},{"created":"2024-02-16T07:35:35Z","description":"I dropdownboksen skal der står markedsrolle efter navn, f.eks. \"Modstrøm (Elleverandør)\"\n\n\u003cimg width=\"1304\" src=\"https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBMFJsQXc9PSIsImV4cCI6bnVsbCwicHVyIjoiYmxvYl9pZCJ9fQ==--6ec0cbed34aeed9437978ba9c8bdc933d92c4d48/image.png\" alt=\"image.png\" /\u003e\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/492","status":"open","title":"Fremsøg forretningsbesked: Vis markedsrolle i dropdown"},{"created":"2024-02-01T13:28:08Z","description":"Delegering - Som admin bruger skal jeg kunne deleger en aktørs beskeder som modtages fra DataHub til en aktør med bruger rollen delegering eller en aktør med samme markedsrolle\n\n**AC**\n- [ ] RSM-012: Fremsend måledata for et målepunkt\n- [ ] RSM-014: Fremsend beregnede tidsserier\n- [ ] RSM-019: Fremsend beregnede engrosydelser\n- [ ] RSM-018: Fremsend hullerlog\n- [ ] RSM-031: Fremsend afregnings stamdata\n- [ ] Hver RSM skal kunne tildeles og fjernes hver for sig således, at det kun er aktive valgte RSM’er der delegeres. Når en RSM er fravalgt skal delegeringen stoppe med det samme.\n- [ ] Alle delegeringer skal kan kunne laves på et net, på flere net eller på alle net.\n- [ ] Der kan kun være en delegeret for hver RSM\n\nUI: https://www.figma.com/file/W40iJ3OwBIYzrRbRlcH6tL/Delegering-af-udg%C3%A5ende-indg%C3%A5ende-beskeder?type=design\u0026node-id=651%3A9033\u0026mode=design\u0026t=diuqfMNyiBsTHGF9-1\n\nForretningsbeskrivelse: https://energinet.atlassian.net/wiki/spaces/D3/pages/657719314/Som+akt+r+skal+jeg+have+mulighed+for+at+lade+en+anden+akt+r+indsende+og+modtage+beskeder+for+mig.\n\nFlow:\nhttps://miro.com/app/board/uXjVMCOTRs0=/?moveToWidget=3458764579116906877\u0026cot=14","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/438","status":"open","title":"Delegering - Delegering af en aktørs beskeder"},{"created":"2024-01-18T09:35:20Z","description":"Som bruger i frontline har jeg behov for at have et overblik mellem roller og rettigheder, så jeg er sikker på, at sammenhængene er korrekte.\n\n\nSKAL GØRES SKARPERE\n**AC**\n- [ ] Tværgående overblik over hvilke rettigheder der ligger i hvilke markedsroller, og hvilke brugerroller der indeholder hvilke rettigheder.\n- [ ] Hvis man skal sætte en ny rettighed ind i x antal brugerroller, er det svært at have et overblik over, hvilke brugerroller man har sat den i, og hvor man er \"kommet til”\n- [ ] Bekymret for at glemme at tildele en rettighed til nogle brugerroller, hvis der kommer nye, og supporten ikke får besked\n- [ ] Fra frontline \"virker ulogisk for mig at jeg skal gå herind på rettigheden og se hvilke markedsroller den ligger i og hvilke brugerroller den er tilknyttet”\n- [ ] En valgt markedsrolle skal fremgå på draweren, når man har valgt brugerrollens rettigheder\n- [ ] På viewet med brugerroller skal markedsroller fremgå tydeligt, da det er den information, man primært har behov for.","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/423","status":"open","title":"Der er behov for et tværgående overblik over hvilke rettigheder der ligger i hvilke markedsroller, og hvilke brugerroller der indeholder hvilke rettigheder."},{"created":"2023-12-01T13:57:46Z","description":"### Synopsis\nSom en Energinet admin bruger skal jeg kunne ændre status på en aktør til 'passiv'\n\n### Acceptance Criteria\nScenarie - aktørstatus aktiv-\u003epassiv\n- [ ] Der må ikke være nogen målepunkter tilknyttet aktøren\n- [ ] Det må ikke være en aktiv netvirksomhed (må ikke have tilknyttet et netområde)\n- [ ] Der må ikke være balanceansvarsrelationer\n- [ ] Aktøren må ikke være delegeret for andre\n- [ ] Hvis man forsøger at sætte en aktør som passiv og nedenstående scenarier ikke er opfyldt, så skal der komme en sig3ende beskrivelse, der angiver hvad der skal ændres (f.eks.: \"Der er målepunkter tilknyttet aktøren\") - ikke hvilke målepunkter.\n- [ ] Ændring skal logges\n- [ ] Man skal kunne redigere aktørnavn hvis aktøren har status 'passiv'. \n- [ ] GLN skal ikke frigøres, heller ikke markedsrollen. \n- [ ] Rettigheden manage-actor skal tilknyttes\n- [ ] Ny status følger med (-\u003epassiv)\n- [ ] Beregninger og beregningskorrektioner kan stadigt foretages\n- [ ] Anmodninger RSM-014, RSM-016\n- [ ] Health Checks er opdaterede (DoD)\n- [ ] C4 diagrammer (DoD)\n\nNote: Organisationer slettes efter 8 år (hvis der ikke er aktører tilknyttet. Status passiv/inaktiv ikke relevant her.\n\n\nhttps://www.figma.com/file/f3NTPECK1OGKwkGJGIi3dL/Organisation-og-akt%C3%B8rer?type=design\u0026node-id=1289-6354\u0026mode=design\u0026t=IEYsF0qS44ng0uM8-4\n\n### Tech. Notes\nStart på UI ligger i en frontend branch: xkama/deactivate-actor\n\n#### Testability\n- [ ] Can be tested?\n- [ ] Can be demoed?\n- [ ] Verified by UX\n\n#### How to testEnviroment:User:Senario:\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/368","status":"open","title":"Aktørstatus aktiv-\u003epassiv"},{"created":"2023-11-02T14:04:15Z","description":null,"link":"https://github.com/Energinet-DataHub/team-raccoons/issues/332","status":"open","title":"Estimer ovenstående"},{"created":"2023-08-21T11:14:22Z","description":"### Synopsis\n\nSom Team Mandalorian har jeg et behov for at kunne hente ubalancepriser i et aftalt format, så de korrekte nettabsfaktureringer kan udføres. \n\nUbalancepriserne (for prisområde 1 \u0026 2) skal modtages og gemmes i DH3. \n\nData skal være til rådighed senest 2. hverdag i en måned. De data, der anvendes er tre måneder gamle.\n\nAfklaring: Hvornår skal vi \"låse teksten\" og kan lægge filen til beregningsmotoren\n\n\n### Acceptance Criteria\n\n- [ ] Prisen modtages som pris for MWatt, men skal konverteres til DH3's beregninger i KWatt.\n- [ ] Data skal være tilgængelige for Wholesale\n- [ ] Monitorering af data stilles til rådighed for beregningsmotoren skal gøres tilgængelig - der må ikke være gaps i data\n\nExcel-ark vedhæftet med et eksempel på en fil modtaget fra Kuben (PHQ)[Specifikation.xlsx](https://api.zenhub.com/attachedFiles/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBak1sIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d813b5bb4416dc4bce04567fb5e17991d076bb9f/Specifikation.xlsx)\n\n### Tech. Notes\n- Data skal leveres som et event\n- Det er ikke afklaret, om vi skal lave det i det subsystem, vi anvender til konvertering af ubalancepriser, eller om det skal \n\nsendes til beregningsmotoren (Kristoffer/Søren)\n\n### Task List\n- [ ]\n- [ ]\n\n#### Testability\n- [ ] Can be tested?\n- [ ] Can be demoed?\n- [ ] Verified by UX\n\n#### How to testEnviroment:User:Senario:\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/251","status":"open","title":"Ubalancepriser - data skal konverteres til korrekt format og stilles til rådighed for wholesale"},{"created":"2023-08-21T09:55:07Z","description":"### Synopsis\n\nSom DataHub har jeg et behov for at kunne importere ubalancepriser fra Excellent/Kontrolcenteret for at kunne lave en korrekt nettabsfakturering. Disse ubalancepriser skal kunne importers så de kan anvendes i processen, der kører (beregner) i DH3.\n\nUbalancepriserne (for prisområde 1 \u0026 2) skal modtages og gemmes i DH3. \nProcessen pt. er at der månedligt manuelt modtages en fil, der indlæses i DH2 (Ivans værktøj). Disse data benyttes efter 3 måneder til ubalanceberegningerne.\n\nUbalanceprisen skal altid være i DKK imed 6 decimaler og det er altid i timer (skal også kunne håndtere kvartersværdier).\nPrisen modtages som pris for MWatt, men skal konverteres til DH3's beregninger i KWatt.\n\n24-08-2023: Estimeret i 'træskolængder' til 2,5 sprints\n\n\n### Tech. Notes\n\n\n#### How to testEnviroment:User:Senario:\n\n","link":"https://github.com/Energinet-DataHub/team-raccoons/issues/248","status":"open","title":"Epic: Ubalancepriser fra Excellent/Kontrolcenter"}]
